ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
# Meow Meow

electroniccats_meow_meow.name=Electronic Cats Meow Meow
electroniccats_meow_meow.vid.0=0x1209
electroniccats_meow_meow.pid.0=0xBAB1
electroniccats_meow_meow.vid.1=0x1209
electroniccats_meow_meow.pid.1=0xBAB1
electroniccats_meow_meow.upload.tool=bossac
electroniccats_meow_meow.upload.protocol=sam-ba
electroniccats_meow_meow.upload.maximum_size=253952
electroniccats_meow_meow.upload.offset=0x2000
electroniccats_meow_meow.upload.use_1200bps_touch=true
electroniccats_meow_meow.upload.wait_for_upload_port=true
electroniccats_meow_meow.upload.native_usb=true
electroniccats_meow_meow.build.mcu=cortex-m0plus
electroniccats_meow_meow.build.f_cpu=48000000L
electroniccats_meow_meow.build.usb_product="Meow Meow"
electroniccats_meow_meow.build.usb_manufacturer="Electronic Cats"
electroniccats_meow_meow.build.board=meow_meow
electroniccats_meow_meow.build.core=arduino
electroniccats_meow_meow.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_meow_meow.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_meow_meow.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
electroniccats_meow_meow.build.variant=meow_meow
electroniccats_meow_meow.build.variant_system_lib=
electroniccats_meow_meow.build.vid=0x1209
electroniccats_meow_meow.build.pid=0xBAB1
electroniccats_meow_meow.bootloader.tool=openocd
electroniccats_meow_meow.bootloader.file=meow_meow/bootloader-meowmeow-v2.0.0.bin

# CatWAN Relay

electroniccats_relay_board.name=Electronic Cats CatWAN Relay Board
electroniccats_relay_board.vid.0=0x1209
electroniccats_relay_board.pid.0=0xBABA
electroniccats_relay_board.vid.1=0x1209
electroniccats_relay_board.pid.1=0xBABA
electroniccats_relay_board.upload.tool=bossac
electroniccats_relay_board.upload.protocol=sam-ba
electroniccats_relay_board.upload.maximum_size=262144
electroniccats_relay_board.upload.offset=0x2000
electroniccats_relay_board.upload.use_1200bps_touch=true
electroniccats_relay_board.upload.wait_for_upload_port=true
electroniccats_relay_board.upload.native_usb=true
electroniccats_relay_board.build.mcu=cortex-m0plus
electroniccats_relay_board.build.f_cpu=48000000L
electroniccats_relay_board.build.usb_product="CatWAN Relay Board"
electroniccats_relay_board.build.usb_manufacturer="Electronic Cats"
electroniccats_relay_board.build.board=catwan_relay_board
electroniccats_relay_board.build.core=arduino
electroniccats_relay_board.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_relay_board.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_relay_board.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_relay_board.build.variant=catwan_relay_board
electroniccats_relay_board.build.variant_system_lib=
electroniccats_relay_board.build.vid=0x1209
electroniccats_relay_board.build.pid=0xBABA
electroniccats_relay_board.bootloader.tool=openocd
electroniccats_relay_board.bootloader.file=catwan_relay_board/bootloader-catwan_relay_board-v2.0.0.bin

# CatWAN Citizen

electroniccats_citizen_board.name=Electronic Cats CatWAN Citizen
electroniccats_citizen_board.vid.0=0x1209
electroniccats_citizen_board.pid.0=0xBAB4
electroniccats_citizen_board.vid.1=0x1209
electroniccats_citizen_board.pid.1=0xBAB4
electroniccats_citizen_board.upload.tool=bossac
electroniccats_citizen_board.upload.protocol=sam-ba
electroniccats_citizen_board.upload.maximum_size=262144
electroniccats_citizen_board.upload.offset=0x2000
electroniccats_citizen_board.upload.use_1200bps_touch=true
electroniccats_citizen_board.upload.wait_for_upload_port=true
electroniccats_citizen_board.upload.native_usb=true
electroniccats_citizen_board.build.mcu=cortex-m0plus
electroniccats_citizen_board.build.f_cpu=48000000L
electroniccats_citizen_board.build.usb_product="CatWAN Citizen"
electroniccats_citizen_board.build.usb_manufacturer="Electronic Cats"
electroniccats_citizen_board.build.board=catwan_citizen
electroniccats_citizen_board.build.core=arduino
electroniccats_citizen_board.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_citizen_board.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_citizen_board.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_citizen_board.build.variant=catwan_citizen
electroniccats_citizen_board.build.variant_system_lib=
electroniccats_citizen_board.build.vid=0x1209
electroniccats_citizen_board.build.pid=0xBAB4
electroniccats_citizen_board.bootloader.tool=openocd
electroniccats_citizen_board.bootloader.file=catwan_citizen/bootloader-catwan-citizen-v3.2.3.bin

# Escornabot Makech

electroniccats_makech.name=Electronic Cats Escornabot Makech
electroniccats_makech.vid.0=0x1209
electroniccats_makech.pid.0=0xBAB6
electroniccats_makech.vid.1=0x1209
electroniccats_makech.pid.1=0xBAB6
electroniccats_makech.upload.tool=bossac
electroniccats_makech.upload.protocol=sam-ba
electroniccats_makech.upload.maximum_size=253952
electroniccats_makech.upload.offset=0x2000
electroniccats_makech.upload.use_1200bps_touch=true
electroniccats_makech.upload.wait_for_upload_port=true
electroniccats_makech.upload.native_usb=true
electroniccats_makech.build.mcu=cortex-m0plus
electroniccats_makech.build.f_cpu=48000000L
electroniccats_makech.build.usb_product="Escornabot Makech"
electroniccats_makech.build.usb_manufacturer="Electronic Cats"
electroniccats_makech.build.board=makech
electroniccats_makech.build.core=arduino
electroniccats_makech.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_makech.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_makech.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
electroniccats_makech.build.variant=makech
electroniccats_makech.build.variant_system_lib=
electroniccats_makech.build.vid=0x1209
electroniccats_makech.build.pid=0xBAB6
electroniccats_makech.bootloader.tool=openocd
electroniccats_makech.bootloader.file=makech/bootloader-escornabot_makech-v3.3.0.bin

# CatWAN Tracker

electroniccats_tracker.name=Electronic Cats CatWAN Tracker
electroniccats_tracker.vid.0=0x1209
electroniccats_tracker.pid.0=0xBAB9
electroniccats_tracker.vid.1=0x1209
electroniccats_tracker.pid.1=0xBAB9
electroniccats_tracker.upload.tool=bossac
electroniccats_tracker.upload.protocol=sam-ba
electroniccats_tracker.upload.maximum_size=253952
electroniccats_tracker.upload.offset=0x2000
electroniccats_tracker.upload.use_1200bps_touch=true
electroniccats_tracker.upload.wait_for_upload_port=true
electroniccats_tracker.upload.native_usb=true
electroniccats_tracker.build.mcu=cortex-m0plus
electroniccats_tracker.build.f_cpu=48000000L
electroniccats_tracker.build.usb_product="CatWAN Tracker"
electroniccats_tracker.build.usb_manufacturer="Electronic Cats"
electroniccats_tracker.build.board=catwan_tracker
electroniccats_tracker.build.core=arduino
electroniccats_tracker.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_tracker.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_tracker.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
electroniccats_tracker.build.variant=catwan_tracker
electroniccats_tracker.build.variant_system_lib=
electroniccats_tracker.build.vid=0x1209
electroniccats_tracker.build.pid=0xBAB9
electroniccats_tracker.bootloader.tool=openocd
electroniccats_tracker.bootloader.file=catwan_tracker/bootloader-tracker-v3.3.0.bin

# NFC Copy Cat

electroniccats_nfc_copy_cat.name=Electronic Cats NCF Copy Cat
electroniccats_nfc_copy_cat.vid.0=0x1209
electroniccats_nfc_copy_cat.pid.0=0xBAB8
electroniccats_nfc_copy_cat.vid.1=0x1209
electroniccats_nfc_copy_cat.pid.1=0xBAB8
electroniccats_nfc_copy_cat.upload.tool=bossac
electroniccats_nfc_copy_cat.upload.protocol=sam-ba
electroniccats_nfc_copy_cat.upload.maximum_size=262144
electroniccats_nfc_copy_cat.upload.offset=0x2000
electroniccats_nfc_copy_cat.upload.use_1200bps_touch=true
electroniccats_nfc_copy_cat.upload.wait_for_upload_port=true
electroniccats_nfc_copy_cat.upload.native_usb=true
electroniccats_nfc_copy_cat.build.mcu=cortex-m0plus
electroniccats_nfc_copy_cat.build.f_cpu=48000000L
electroniccats_nfc_copy_cat.build.usb_product="NFC Copy Cat"
electroniccats_nfc_copy_cat.build.usb_manufacturer="Electronic Cats"
electroniccats_nfc_copy_cat.build.board=nfc_copy_cat
electroniccats_nfc_copy_cat.build.core=arduino
electroniccats_nfc_copy_cat.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_nfc_copy_cat.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
electroniccats_nfc_copy_cat.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_nfc_copy_cat.build.variant=nfc_copy_cat
electroniccats_nfc_copy_cat.build.variant_system_lib=
electroniccats_nfc_copy_cat.build.vid=0x1209
electroniccats_nfc_copy_cat.build.pid=0xBAB8
electroniccats_nfc_copy_cat.bootloader.tool=openocd
electroniccats_nfc_copy_cat.bootloader.file=nfc_copy_cat/bootloader-nfc_copy_cat-v3.4.0.bin

# Magspoof v3 based on D11C14A (SOIC-14)
magspoof.name= Magspoof V3
magspoof.vid.0=0x1209
magspoof.pid.0=0xBAB5
magspoof.vid.1=0x1209
magspoof.pid.1=0xBAB5
magspoof.vid.2=0x1209
magspoof.pid.2=0xBAB5
magspoof.vid.3=0x1209
magspoof.pid.3=0xBAB5
magspoof.vid.4=0x1209
magspoof.pid.4=0xBAB5
magspoof.vid.5=0x1209
magspoof.pid.5=0xBAB5
magspoof.build.mcu=cortex-m0plus
magspoof.build.mathlib=arm_cortexM0l_math
magspoof.build.f_cpu=48000000L
magspoof.build.usb_product="Magspoof V3"
magspoof.build.usb_manufacturer="Electronic Cats"
magspoof.build.board=SAMD_ZERO
magspoof.build.core=arduino
magspoof.build.variant=magspoofv3
magspoof.build.variant_system_lib=
magspoof.build.vid=0x1209
magspoof.upload.protocol=sam-ba
magspoof.bootloader.tool=arduino:openocd
magspoof.menu.float.default=Print & String use auto-promoted doubles only
magspoof.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
magspoof.menu.float.print=Print uses separate singles and doubles
magspoof.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
magspoof.menu.float.string=String uses separate singles and doubles
magspoof.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
magspoof.menu.float.both=Print & String use separate singles and doubles
magspoof.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
magspoof.menu.config.disabled=config.h disabled
magspoof.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
magspoof.menu.config.enabled=config.h enabled (mostly code size reductions)
magspoof.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
magspoof.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
magspoof.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
magspoof.menu.clock.internal=INTERNAL_OSCILLATOR
magspoof.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
magspoof.menu.clock.crystal_32k=32KHZ_CRYSTAL
magspoof.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
magspoof.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
magspoof.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
magspoof.menu.timer.timer_732Hz=732.4Hz (16-bit)
magspoof.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
magspoof.menu.timer.timer_366Hz=366.2Hz (16-bit)
magspoof.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
magspoof.menu.timer.timer_244Hz=244.1Hz (16-bit)
magspoof.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
magspoof.menu.timer.timer_183Hz=183.1Hz (16-bit)
magspoof.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
magspoof.menu.timer.timer_146Hz=146.5Hz (16-bit)
magspoof.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
magspoof.menu.timer.timer_122Hz=122.1Hz (16-bit)
magspoof.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
magspoof.menu.timer.timer_105Hz=104.6Hz (16-bit)
magspoof.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
magspoof.menu.timer.timer_81Hz=81.38Hz (16-bit)
magspoof.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
magspoof.menu.timer.timer_61Hz=61.04Hz (16-bit)
magspoof.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
magspoof.menu.timer.timer_31Hz=30.52Hz (16-bit)
magspoof.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
magspoof.menu.timer.timer_187500Hz=187500Hz (8-bit)
magspoof.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
magspoof.menu.timer.timer_93750Hz=93750Hz (8-bit)
magspoof.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
magspoof.menu.timer.timer_62500Hz=62500Hz (8-bit)
magspoof.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
magspoof.menu.timer.timer_37500Hz=37500Hz (8-bit)
magspoof.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
magspoof.menu.timer.timer_20833Hz=20833Hz (8-bit)
magspoof.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
magspoof.menu.timer.timer_12500Hz=12500Hz (8-bit)
magspoof.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
magspoof.menu.timer.timer_7500Hz=7500Hz (8-bit)
magspoof.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
magspoof.menu.timer.timer_4166Hz=4166Hz (8-bit)
magspoof.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
magspoof.menu.timer.timer_2930Hz=2930Hz (8-bit)
magspoof.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
magspoof.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
magspoof.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
magspoof.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
magspoof.build.ldscript=flash_16KB.ld
magspoof.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
magspoof.bootloader.file=zero/binaries/sam_ba_magspoof_SAMD11C14A.bin
magspoof.menu.bootloader.4kb=4KB_BOOTLOADER
magspoof.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
magspoof.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
magspoof.menu.bootloader.4kb.upload.tool=bossac
magspoof.menu.bootloader.4kb.upload.use_1200bps_touch=true
magspoof.menu.bootloader.4kb.upload.wait_for_upload_port=true
magspoof.menu.bootloader.4kb.upload.native_usb=true
magspoof.menu.bootloader.4kb.upload.maximum_size=12288
magspoof.menu.bootloader.0kb=NO_BOOTLOADER
magspoof.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
magspoof.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
magspoof.menu.bootloader.0kb.upload.tool=arduino:openocd
magspoof.menu.bootloader.0kb.upload.use_1200bps_touch=false
magspoof.menu.bootloader.0kb.upload.wait_for_upload_port=false
magspoof.menu.bootloader.0kb.upload.native_usb=false
magspoof.menu.bootloader.0kb.upload.maximum_size=16384
magspoof.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
magspoof.menu.serial.one_uart.build.serialcom_uart=ONE_UART
magspoof.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
magspoof.menu.serial.one_uart.build.serialcom_spi=NO_SPI
magspoof.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
magspoof.menu.serial.two_uart.build.serialcom_uart=TWO_UART
magspoof.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
magspoof.menu.serial.two_uart.build.serialcom_spi=NO_SPI
magspoof.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
magspoof.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
magspoof.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
magspoof.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
magspoof.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
magspoof.menu.serial.no_uart.build.serialcom_uart=NO_UART
magspoof.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
magspoof.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
magspoof.menu.usb.cdc=CDC_ONLY
magspoof.menu.usb.cdc.build.usbcom=CDC_ONLY
magspoof.menu.usb.cdc.build.pid=0xBAB5
magspoof.menu.usb.cdc_hid=CDC_HID
magspoof.menu.usb.cdc_hid.build.usbcom=CDC_HID
magspoof.menu.usb.cdc_hid.build.pid=0xBAB5
magspoof.menu.usb.withcdc=WITH_CDC
magspoof.menu.usb.withcdc.build.usbcom=WITH_CDC
magspoof.menu.usb.withcdc.build.pid=0xBAB5
magspoof.menu.usb.hid=HID_ONLY
magspoof.menu.usb.hid.build.usbcom=HID_ONLY
magspoof.menu.usb.hid.build.pid=0xBAB5
magspoof.menu.usb.nocdc=WITHOUT_CDC
magspoof.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
magspoof.menu.usb.nocdc.build.pid=0xBAB5
magspoof.menu.usb.none=USB_DISABLED
magspoof.menu.usb.none.build.usbcom=USB_DISABLED
magspoof.menu.usb.none.build.pid=0xBAB5

# Electronic BastFamily based on SAMR34

